Repository: CofficLab/GitOK
Catalog: Packages/PluginLogoManager/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: A plugin contributes its logo item with an order.
zh_hans: 插件携带顺序号贡献自己的 Logo 条目。
zh_hk: 外掛程式攜帶順序號貢獻自己的 Logo 條目。

source: Central Registry
zh_hans: 集中注册
zh_hk: 集中註冊

source: Central registry
zh_hans: 集中注册表
zh_hk: 集中註冊表

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Deterministic Order
zh_hans: 确定性排序
zh_hk: 確定性排序

source: Every plugin registers its logo contribution in one place.
zh_hans: 每个插件都在同一处注册自己的 Logo 贡献。
zh_hk: 每個外掛程式都在同一處註冊自己的 Logo 貢獻。

source: Highlight State
zh_hans: 高亮状态
zh_hk: 高亮狀態

source: Highlight-aware
zh_hans: 感知高亮
zh_hk: 感知高亮

source: How It Works
zh_hans: 工作原理
zh_hk: 工作原理

source: Items are sorted and de-duplicated so the result is always stable.
zh_hans: 条目经过排序与去重，结果始终稳定。
zh_hk: 條目經過排序與去重，結果始終穩定。

source: Merge
zh_hans: 合并
zh_hk: 合併

source: One place that owns every logo in GitOK.
zh_hans: 一处统一掌管 GitOK 的所有 Logo。
zh_hk: 一處統一掌管 GitOK 的所有 Logo。

source: Ordered
zh_hans: 有序
zh_hk: 有序

source: Plugins can mark a logo as highlighted for special moments.
zh_hans: 插件可在特殊时刻把某个 Logo 标记为高亮。
zh_hk: 外掛程式可在特殊時刻把某個 Logo 標記為高亮。

source: Register
zh_hans: 注册
zh_hk: 註冊

source: Render
zh_hans: 渲染
zh_hk: 渲染

source: The manager merges, de-duplicates, and sorts all items.
zh_hans: 管理器合并、去重并排序所有条目。
zh_hk: 管理器合併、去重並排序所有條目。

source: Views read the final list and draw the active logo.
zh_hans: 视图读取最终列表并绘制当前 Logo。
zh_hk: 檢視讀取最終列表並繪製目前 Logo。

source: logo items
zh_hans: Logo 条目
zh_hk: Logo 條目

source: logo provider
zh_hans: Logo 提供方
zh_hk: Logo 提供方
